; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared0 - mode
	spectrograph1 - mode
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star8 - direction
	Star6 - direction
	GroundStation5 - direction
	Star2 - direction
	Star4 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star6)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 Star2)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation9)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 Star4)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star4)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation7)
	(supports instrument6 spectrograph1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation9)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet11)
)
(:goal (and
	(pointing satellite0 Star8)
	(pointing satellite2 GroundStation9)
	(have_image Planet10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Planet12 spectrograph1)
	(have_image Star13 spectrograph1)
	(have_image Phenomenon14 spectrograph1)
))

)

; plan
1. (turn_to satellite2 groundstation5 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 groundstation5)
   goals met: 0 of 7
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 0 of 7
3. (calibrate satellite2 instrument2 groundstation5)
   added: (calibrated instrument2)
   goals met: 0 of 7
4. (turn_to satellite2 planet10 groundstation5)
   deleted: (pointing satellite2 groundstation5)
   added: (pointing satellite2 planet10)
   goals met: 0 of 7
5. (take_image satellite2 planet10 instrument2 spectrograph1)
   added: (have_image planet10 spectrograph1)
   goals met: 1 of 7
6. (turn_to satellite2 phenomenon14 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon14)
   goals met: 1 of 7
7. (turn_to satellite0 star8 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star8)
   goals met: 2 of 7
8. (take_image satellite2 phenomenon14 instrument2 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 3 of 7
9. (turn_to satellite2 planet11 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 planet11)
   goals met: 3 of 7
10. (take_image satellite2 planet11 instrument2 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 4 of 7
11. (turn_to satellite2 planet12 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 planet12)
   goals met: 4 of 7
12. (take_image satellite2 planet12 instrument2 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 5 of 7
13. (turn_to satellite2 star13 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 star13)
   goals met: 5 of 7
14. (take_image satellite2 star13 instrument2 spectrograph1)
   added: (have_image star13 spectrograph1)
   goals met: 6 of 7
15. (turn_to satellite2 groundstation9 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 groundstation9)
   goals met: 7 of 7
